Masmiseim36/nxpSDK/boards/evkmimxrt1060/crank_storyboard_examples/crank_storyboard_coffeeapp/pin_mux.h
/* GPIO_B1_01 (coord B11), LCDIF_D13 */
#define BOARD_INITPINS_LCDIF_D13_PERIPHERAL                                LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITPINS_LCDIF_D13_SIGNAL                               lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITPINS_LCDIF_D13_CHANNEL                                     13U   /*!< LCDIF lcdif_data channel: 13 */

/* GPIO_B1_02 (coord C11), LCDIF_D14 */
#define BOARD_INITPINS_LCDIF_D14_PERIPHERAL                                LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITPINS_LCDIF_D14_SIGNAL                               lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITPINS_LCDIF_D14_CHANNEL                                     14U   /*!< LCDIF lcdif_data channel: 14 */

/* GPIO_B1_03 (coord D11), LCDIF_D15 */
#define BOARD_INITPINS_LCDIF_D15_PERIPHERAL                                LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITPINS_LCDIF_D15_SIGNAL                               lcdif_data   /*!< LCDIF signal: lcdif_data */
#define BOARD_INITPINS_LCDIF_D15_CHANNEL                                     15U   /*!< LCDIF lcdif_data channel: 15 */

/* GPIO_B0_01 (coord E7), LCDIF_ENABLE */
#define BOARD_INITPINS_LCDIF_ENABLE_PERIPHERAL                             LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITPINS_LCDIF_ENABLE_SIGNAL                          lcdif_enable   /*!< LCDIF signal: lcdif_enable */

/* GPIO_B0_02 (coord E8), LCDIF_HSYNC */
#define BOARD_INITPINS_LCDIF_HSYNC_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITPINS_LCDIF_HSYNC_SIGNAL                            lcdif_hsync   /*!< LCDIF signal: lcdif_hsync */

/* GPIO_B0_03 (coord D8), LCDIF_VSYNC */
#define BOARD_INITPINS_LCDIF_VSYNC_PERIPHERAL                              LCDIF   /*!< Device name: LCDIF */
#define BOARD_INITPINS_LCDIF_VSYNC_SIGNAL                            lcdif_vsync   /*!< LCDIF signal: lcdif_vsync */

/* GPIO_B1_15 (coord B14), USB_HOST_PWR/BACKLIGHT_CTL */
#define BOARD_INITPINS_BACKLIGHT_CTL_GPIO                                  GPIO2   /*!< GPIO device name: GPIO2 */
#define BOARD_INITPINS_BACKLIGHT_CTL_PORT                                  GPIO2   /*!< PORT device name: GPIO2 */
#define BOARD_INITPINS_BACKLIGHT_CTL_PIN                                     31U   /*!< GPIO2 pin index: 31 */

/* WAKEUP (coord L6), SD_PWREN */
#define BOARD_INITPINS_SD_PWREN_GPIO                                       GPIO5   /*!< GPIO device name: GPIO5 */
#define BOARD_INITPINS_SD_PWREN_PORT                                       GPIO5   /*!< PORT device name: GPIO5 */
#define BOARD_INITPINS_SD_PWREN_PIN                                           0U   /*!< GPIO5 pin index: 0 */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_EMC_09 (coord C2), SEMC_A0 */
#define BOARD_INITSEMCPINS_SEMC_A0_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A0_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A0_CHANNEL                                    0U   /*!< SEMC ADDR channel: 00 */

/* GPIO_EMC_10 (coord G1), SEMC_A1 */
#define BOARD_INITSEMCPINS_SEMC_A1_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A1_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A1_CHANNEL                                    1U   /*!< SEMC ADDR channel: 01 */

/* GPIO_EMC_11 (coord G3), SEMC_A2 */
#define BOARD_INITSEMCPINS_SEMC_A2_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A2_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A2_CHANNEL                                    2U   /*!< SEMC ADDR channel: 02 */

/* GPIO_EMC_12 (coord H1), SEMC_A3 */
#define BOARD_INITSEMCPINS_SEMC_A3_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A3_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A3_CHANNEL                                    3U   /*!< SEMC ADDR channel: 03 */

/* GPIO_EMC_13 (coord A6), SEMC_A4 */
#define BOARD_INITSEMCPINS_SEMC_A4_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A4_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A4_CHANNEL                                    4U   /*!< SEMC ADDR channel: 04 */

/* GPIO_EMC_14 (coord B6), SEMC_A5 */
#define BOARD_INITSEMCPINS_SEMC_A5_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A5_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A5_CHANNEL                                    5U   /*!< SEMC ADDR channel: 05 */

/* GPIO_EMC_15 (coord B1), SEMC_A6 */
#define BOARD_INITSEMCPINS_SEMC_A6_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A6_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A6_CHANNEL                                    6U   /*!< SEMC ADDR channel: 06 */

/* GPIO_EMC_16 (coord A5), SEMC_A7 */
#define BOARD_INITSEMCPINS_SEMC_A7_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A7_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A7_CHANNEL                                    7U   /*!< SEMC ADDR channel: 07 */

/* GPIO_EMC_17 (coord A4), SEMC_A8 */
#define BOARD_INITSEMCPINS_SEMC_A8_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A8_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A8_CHANNEL                                    8U   /*!< SEMC ADDR channel: 08 */

/* GPIO_EMC_18 (coord B2), SEMC_A9 */
#define BOARD_INITSEMCPINS_SEMC_A9_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A9_SIGNAL                                   ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A9_CHANNEL                                    9U   /*!< SEMC ADDR channel: 09 */

/* GPIO_EMC_23 (coord G2), SEMC_A10 */
#define BOARD_INITSEMCPINS_SEMC_A10_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A10_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A10_CHANNEL                                  10U   /*!< SEMC ADDR channel: 10 */

