Masmiseim36/nxpSDK/boards/evkmimxrt1060/crank_storyboard_examples/crank_storyboard_coffeeapp/pin_mux.h
/* GPIO_EMC_19 (coord B4), SEMC_A11 */
#define BOARD_INITSEMCPINS_SEMC_A11_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A11_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A11_CHANNEL                                  11U   /*!< SEMC ADDR channel: 11 */

/* GPIO_EMC_20 (coord A3), SEMC_A12 */
#define BOARD_INITSEMCPINS_SEMC_A12_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_A12_SIGNAL                                  ADDR   /*!< SEMC signal: ADDR */
#define BOARD_INITSEMCPINS_SEMC_A12_CHANNEL                                  12U   /*!< SEMC ADDR channel: 12 */

/* GPIO_EMC_21 (coord C1), SEMC_BA0 */
#define BOARD_INITSEMCPINS_SEMC_BA0_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_BA0_SIGNAL                                    BA   /*!< SEMC signal: BA */
#define BOARD_INITSEMCPINS_SEMC_BA0_CHANNEL                                   0U   /*!< SEMC BA channel: 0 */

/* GPIO_EMC_22 (coord F1), SEMC_BA1 */
#define BOARD_INITSEMCPINS_SEMC_BA1_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_BA1_SIGNAL                                    BA   /*!< SEMC signal: BA */
#define BOARD_INITSEMCPINS_SEMC_BA1_CHANNEL                                   1U   /*!< SEMC BA channel: 1 */

/* GPIO_EMC_24 (coord D3), SEMC_CAS */
#define BOARD_INITSEMCPINS_SEMC_CAS_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_CAS_SIGNAL                              semc_cas   /*!< SEMC signal: semc_cas */

/* GPIO_EMC_27 (coord A2), SEMC_CKE */
#define BOARD_INITSEMCPINS_SEMC_CKE_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_CKE_SIGNAL                              semc_cke   /*!< SEMC signal: semc_cke */

/* GPIO_EMC_26 (coord B3), SEMC_CLK */
#define BOARD_INITSEMCPINS_SEMC_CLK_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_CLK_SIGNAL                              semc_clk   /*!< SEMC signal: semc_clk */

/* GPIO_EMC_29 (coord E1), SEMC_CS0 */
#define BOARD_INITSEMCPINS_SEMC_CS0_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_CS0_SIGNAL                                    CS   /*!< SEMC signal: CS */
#define BOARD_INITSEMCPINS_SEMC_CS0_CHANNEL                                   0U   /*!< SEMC CS channel: 0 */

/* GPIO_EMC_00 (coord E3), SEMC_D0 */
#define BOARD_INITSEMCPINS_SEMC_D0_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D0_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D0_CHANNEL                                    0U   /*!< SEMC DATA channel: 00 */

/* GPIO_EMC_01 (coord F3), SEMC_D1 */
#define BOARD_INITSEMCPINS_SEMC_D1_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D1_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D1_CHANNEL                                    1U   /*!< SEMC DATA channel: 01 */

/* GPIO_EMC_02 (coord F4), SEMC_D2 */
#define BOARD_INITSEMCPINS_SEMC_D2_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D2_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D2_CHANNEL                                    2U   /*!< SEMC DATA channel: 02 */

/* GPIO_EMC_03 (coord G4), SEMC_D3 */
#define BOARD_INITSEMCPINS_SEMC_D3_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D3_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D3_CHANNEL                                    3U   /*!< SEMC DATA channel: 03 */

/* GPIO_EMC_04 (coord F2), SEMC_D4 */
#define BOARD_INITSEMCPINS_SEMC_D4_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D4_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D4_CHANNEL                                    4U   /*!< SEMC DATA channel: 04 */

/* GPIO_EMC_05 (coord G5), SEMC_D5 */
#define BOARD_INITSEMCPINS_SEMC_D5_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D5_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D5_CHANNEL                                    5U   /*!< SEMC DATA channel: 05 */

/* GPIO_EMC_06 (coord H5), SEMC_D6 */
#define BOARD_INITSEMCPINS_SEMC_D6_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D6_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D6_CHANNEL                                    6U   /*!< SEMC DATA channel: 06 */

/* GPIO_EMC_07 (coord H4), SEMC_D7 */
#define BOARD_INITSEMCPINS_SEMC_D7_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D7_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D7_CHANNEL                                    7U   /*!< SEMC DATA channel: 07 */

/* GPIO_EMC_30 (coord C6), SEMC_D8 */
#define BOARD_INITSEMCPINS_SEMC_D8_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D8_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D8_CHANNEL                                    8U   /*!< SEMC DATA channel: 08 */

/* GPIO_EMC_31 (coord C5), SEMC_D9 */
#define BOARD_INITSEMCPINS_SEMC_D9_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D9_SIGNAL                                   DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D9_CHANNEL                                    9U   /*!< SEMC DATA channel: 09 */

/* GPIO_EMC_32 (coord D5), SEMC_D10 */
#define BOARD_INITSEMCPINS_SEMC_D10_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D10_SIGNAL                                  DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D10_CHANNEL                                  10U   /*!< SEMC DATA channel: 10 */

/* GPIO_EMC_33 (coord C4), SEMC_D11 */
#define BOARD_INITSEMCPINS_SEMC_D11_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D11_SIGNAL                                  DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D11_CHANNEL                                  11U   /*!< SEMC DATA channel: 11 */

