Masmiseim36/nxpSDK/boards/evkmimxrt1060/crank_storyboard_examples/crank_storyboard_coffeeapp/pin_mux.h
/* GPIO_EMC_34 (coord D4), SEMC_D12 */
#define BOARD_INITSEMCPINS_SEMC_D12_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D12_SIGNAL                                  DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D12_CHANNEL                                  12U   /*!< SEMC DATA channel: 12 */

/* GPIO_EMC_35 (coord E5), SEMC_D13 */
#define BOARD_INITSEMCPINS_SEMC_D13_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D13_SIGNAL                                  DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D13_CHANNEL                                  13U   /*!< SEMC DATA channel: 13 */

/* GPIO_EMC_36 (coord C3), SEMC_D14 */
#define BOARD_INITSEMCPINS_SEMC_D14_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D14_SIGNAL                                  DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D14_CHANNEL                                  14U   /*!< SEMC DATA channel: 14 */

/* GPIO_EMC_37 (coord E4), SEMC_D15 */
#define BOARD_INITSEMCPINS_SEMC_D15_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_D15_SIGNAL                                  DATA   /*!< SEMC signal: DATA */
#define BOARD_INITSEMCPINS_SEMC_D15_CHANNEL                                  15U   /*!< SEMC DATA channel: 15 */

/* GPIO_EMC_08 (coord H3), SEMC_DM0 */
#define BOARD_INITSEMCPINS_SEMC_DM0_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_DM0_SIGNAL                                    DM   /*!< SEMC signal: DM */
#define BOARD_INITSEMCPINS_SEMC_DM0_CHANNEL                                   0U   /*!< SEMC DM channel: 0 */

/* GPIO_EMC_38 (coord D6), SEMC_DM1 */
#define BOARD_INITSEMCPINS_SEMC_DM1_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_DM1_SIGNAL                                    DM   /*!< SEMC signal: DM */
#define BOARD_INITSEMCPINS_SEMC_DM1_CHANNEL                                   1U   /*!< SEMC DM channel: 1 */

/* GPIO_EMC_25 (coord D2), SEMC_RAS */
#define BOARD_INITSEMCPINS_SEMC_RAS_PERIPHERAL                              SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_RAS_SIGNAL                              semc_ras   /*!< SEMC signal: semc_ras */

/* GPIO_EMC_28 (coord D1), SEMC_WE */
#define BOARD_INITSEMCPINS_SEMC_WE_PERIPHERAL                               SEMC   /*!< Device name: SEMC */
#define BOARD_INITSEMCPINS_SEMC_WE_SIGNAL                                semc_we   /*!< SEMC signal: semc_we */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSemcPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
